[Killed] BlockStatement
src/app.js:15:25
 function createApp({
   checkoutService
 }) {
-  if (!checkoutService) {
-    throw new Error(
-      'checkoutService é obrigatório'
-    );
-  }
+  if (!checkoutService) {}
 
   const app = express();
killedBy: createApp - tratamentos de erro deve exigir o serviço de checkout
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "checkoutService é obrigatório"

Received function did not throw
