[Killed] MethodExpression
src/validation/PedidoValidator.js:57:7
   campoPreenchido(valor) {
     return (
       typeof valor === 'string' &&
-      valor.trim().length > 0
+      valor.length > 0
     );
   }
killedBy: PedidoValidator - casos de limite deve rejeitar campos do cartão preenchidos apenas com espaços
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Número do cartão é obrigatório"

Received function did not throw
