[Killed] ArrayDeclaration
src/app.js:3:33
 ﻿const express = require('express');
 
-const ERROS_VALIDACAO = new Set([
-  'E-mail do cliente inválido',
-  'Valor do pedido inválido',
-  'Cartão inválido',
-  'Número do cartão é obrigatório',
-  'Validade do cartão é obrigatória',
-  'CVV do cartão é obrigatório'
-]);
+const ERROS_VALIDACAO = new Set([]);
 
 function createApp({
killedBy: POST /checkout deve retornar 400 sem chamar dependências quando o pedido for inválido
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Survived] StringLiteral
src/app.js:5:3
 
 const ERROS_VALIDACAO = new Set([
   'E-mail do cliente inválido',
-  'Valor do pedido inválido',
+  "",
   'Cartão inválido',
   'Número do cartão é obrigatório',

[Killed] BooleanLiteral
src/app.js:15:7
 function createApp({
   checkoutService
 }) {
-  if (!checkoutService) {
+  if (checkoutService) {
     throw new Error(
       'checkoutService é obrigatório'
killedBy: POST /checkout deve retornar 200 quando o pagamento for aprovado
statusReason: Error: checkoutService é obrigatório

[Killed] ConditionalExpression
src/app.js:15:7
 function createApp({
   checkoutService
 }) {
-  if (!checkoutService) {
+  if (true) {
     throw new Error(
       'checkoutService é obrigatório'
killedBy: POST /checkout deve retornar 200 quando o pagamento for aprovado
statusReason: Error: checkoutService é obrigatório

[NoCoverage] StringLiteral
src/app.js:17:7
 }) {
   if (!checkoutService) {
     throw new Error(
-      'checkoutService é obrigatório'
+      ""
     );
   }

[Timeout] BlockStatement
src/app.js:26:9
   app.use(express.json());
 
   app.post('/checkout', async (request, response) => {
-    try {
-      const resultado =
-        await checkoutService.processar(
-          request.body
-        );
-
-      if (!resultado) {
-        return response.status(500).json({
-          erro: 'Pagamento não aprovado'
-        });
-      }
-
-      return response.status(200).json(
-        resultado
-      );
-    } catch (erro) {
+    try {} catch (erro) {
       if (ERROS_VALIDACAO.has(erro.message)) {
         return response.status(400).json({

[Killed] ConditionalExpression
src/app.js:32:11
           request.body
         );
 
-      if (!resultado) {
+      if (true) {
         return response.status(500).json({
           erro: 'Pagamento não aprovado'
killedBy: POST /checkout deve retornar 200 quando o pagamento for aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
src/app.js:32:23
           request.body
         );
 
-      if (!resultado) {
-        return response.status(500).json({
-          erro: 'Pagamento não aprovado'
-        });
-      }
+      if (!resultado) {}
 
       return response.status(200).json(
killedBy: POST /checkout deve retornar 500 quando o pagamento for recusado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] ObjectLiteral
src/app.js:33:42
         );
 
       if (!resultado) {
-        return response.status(500).json({
-          erro: 'Pagamento não aprovado'
-        });
+        return response.status(500).json({});
       }
 
killedBy: POST /checkout deve retornar 500 quando o pagamento for recusado
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "erro": "Pagamento não aprovado",
- }

[Killed] BlockStatement
src/app.js:41:20
       return response.status(200).json(
         resultado
       );
-    } catch (erro) {
-      if (ERROS_VALIDACAO.has(erro.message)) {
-        return response.status(400).json({
-          erro: erro.message
-        });
-      }
-
-      console.error(
-        'Erro inesperado no checkout:',
-        erro.message
-      );
-
-      return response.status(500).json({
-        erro: 'Erro interno no checkout'
-      });
-    }
+    } catch (erro) {}
   });
 
killedBy: POST /checkout deve retornar 400 sem chamar dependências quando o pedido for inválido
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/app.js:42:11
         resultado
       );
     } catch (erro) {
-      if (ERROS_VALIDACAO.has(erro.message)) {
+      if (false) {
         return response.status(400).json({
           erro: erro.message
killedBy: POST /checkout deve retornar 400 sem chamar dependências quando o pedido for inválido
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] BlockStatement
src/app.js:42:46
         resultado
       );
     } catch (erro) {
-      if (ERROS_VALIDACAO.has(erro.message)) {
-        return response.status(400).json({
-          erro: erro.message
-        });
-      }
+      if (ERROS_VALIDACAO.has(erro.message)) {}
 
       console.error(
killedBy: POST /checkout deve retornar 400 sem chamar dependências quando o pedido for inválido
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ObjectLiteral
src/app.js:43:42
       );
     } catch (erro) {
       if (ERROS_VALIDACAO.has(erro.message)) {
-        return response.status(400).json({
-          erro: erro.message
-        });
+        return response.status(400).json({});
       }
 
killedBy: POST /checkout deve retornar 400 sem chamar dependências quando o pedido for inválido
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "erro": "E-mail do cliente inválido",
- }

[NoCoverage] ObjectLiteral
src/app.js:53:40
         erro.message
       );
 
-      return response.status(500).json({
-        erro: 'Erro interno no checkout'
-      });
+      return response.status(500).json({});
     }
   });
