[Killed] BlockStatement
src/resilience/CircuitBreaker.js:2:17
 ﻿class CircuitBreakerOpenError extends Error {
-  constructor() {
-    super('Circuit breaker aberto');
-
-    this.name = 'CircuitBreakerOpenError';
-    this.code = 'CIRCUIT_BREAKER_ABERTO';
-  }
+  constructor() {}
 }
 
killedBy: CircuitBreaker deve abrir quando a taxa de falhas ultrapassar 50%
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Circuit breaker aberto"
Received message:   "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      54 |       super(stryMutAct_9fa48("32") ? "" : (stryCov_9fa48("32"), 'Circuit breaker aberto'));
      55 |       this.name = stryMutAct_9fa48("33") ? "" : (stryCov_9fa48("33")

[Killed] StringLiteral
src/resilience/CircuitBreaker.js:3:11
 ﻿class CircuitBreakerOpenError extends Error {
   constructor() {
-    super('Circuit breaker aberto');
+    super("");
 
     this.name = 'CircuitBreakerOpenError';
killedBy: CircuitBreaker deve abrir quando a taxa de falhas ultrapassar 50%
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Circuit breaker aberto"
Received message:   ""

      102 |         }
      103 |       }
    > 104 |       throw new CircuitBreakerOpenError();

[NoCoverage] ArrowFunction
src/resilience/CircuitBreaker.js:15:15
     limiteFalhas = 0.5,
     minimoAmostras = 4,
     tempoAbertoMs = 5000,
-    agoraFn = () => Date.now()
+    agoraFn = () => undefined
   } = {}) {
     this.limiteFalhas = limiteFalhas;

[Killed] BlockStatement
src/resilience/CircuitBreaker.js:16:11
     minimoAmostras = 4,
     tempoAbertoMs = 5000,
     agoraFn = () => Date.now()
-  } = {}) {
-    this.limiteFalhas = limiteFalhas;
-    this.minimoAmostras = minimoAmostras;
-    this.tempoAbertoMs = tempoAbertoMs;
-    this.agoraFn = agoraFn;
-
-    this.estado = 'FECHADO';
-    this.totalExecucoes = 0;
-    this.totalFalhas = 0;
-    this.abertoEm = null;
-  }
+  } = {}) {}
 
   verificarPermissao() {
killedBy: CircuitBreaker deve permanecer fechado quando a taxa de falhas for igual a 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FECHADO"
Received: undefined

[Killed] BlockStatement
src/resilience/CircuitBreaker.js:28:24
     this.abertoEm = null;
   }
 
-  verificarPermissao() {
-    if (this.estado !== 'ABERTO') {
-      return true;
-    }
-
-    const tempoDecorrido =
-      this.agoraFn() - this.abertoEm;
-
-    if (tempoDecorrido >= this.tempoAbertoMs) {
-      this.estado = 'MEIO_ABERTO';
-      return true;
-    }
-
-    throw new CircuitBreakerOpenError();
-  }
+  verificarPermissao() {}
 
   registrarSucesso() {
killedBy: CircuitBreaker deve abrir quando a taxa de falhas ultrapassar 50%
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Circuit breaker aberto"

Received function did not throw

[Killed] ConditionalExpression
src/resilience/CircuitBreaker.js:29:9
   }
 
   verificarPermissao() {
-    if (this.estado !== 'ABERTO') {
+    if (false) {
       return true;
     }
killedBy: CircuitBreaker deve permanecer fechado quando a taxa de falhas for igual a 50%
statusReason: Error: expect(received).not.toThrow()

Error name:    "CircuitBreakerOpenError"
Error message: "Circuit breaker aberto"

      102 |         }
      103 |       }
    > 104 |       throw new CircuitBreakerOpenError();

[Killed] BlockStatement
src/resilience/CircuitBreaker.js:29:35
   }
 
   verificarPermissao() {
-    if (this.estado !== 'ABERTO') {
-      return true;
-    }
+    if (this.estado !== 'ABERTO') {}
 
     const tempoDecorrido =
killedBy: CircuitBreaker deve permanecer fechado quando a taxa de falhas for igual a 50%
statusReason: Error: expect(received).not.toThrow()

Error name:    "CircuitBreakerOpenError"
Error message: "Circuit breaker aberto"

      102 |         }
      103 |       }
    > 104 |       throw new CircuitBreakerOpenError();

[Survived] BooleanLiteral
src/resilience/CircuitBreaker.js:30:14
 
   verificarPermissao() {
     if (this.estado !== 'ABERTO') {
-      return true;
+      return false;
     }
 

[Killed] ArithmeticOperator
src/resilience/CircuitBreaker.js:34:7
     }
 
     const tempoDecorrido =
-      this.agoraFn() - this.abertoEm;
+      this.agoraFn() + this.abertoEm;
 
     if (tempoDecorrido >= this.tempoAbertoMs) {
killedBy: CircuitBreaker deve voltar ao estado aberto após falha no estado meio aberto
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Circuit breaker aberto"

Received function did not throw

[Killed] ConditionalExpression
src/resilience/CircuitBreaker.js:36:9
     const tempoDecorrido =
       this.agoraFn() - this.abertoEm;
 
-    if (tempoDecorrido >= this.tempoAbertoMs) {
+    if (false) {
       this.estado = 'MEIO_ABERTO';
       return true;
killedBy: CircuitBreaker deve mudar para meio aberto após o período de recuperação
statusReason: Error: expect(received).not.toThrow()

Error name:    "CircuitBreakerOpenError"
Error message: "Circuit breaker aberto"

      102 |         }
      103 |       }
    > 104 |       throw new CircuitBreakerOpenError();

[Killed] BlockStatement
src/resilience/CircuitBreaker.js:36:47
     const tempoDecorrido =
       this.agoraFn() - this.abertoEm;
 
-    if (tempoDecorrido >= this.tempoAbertoMs) {
-      this.estado = 'MEIO_ABERTO';
-      return true;
-    }
+    if (tempoDecorrido >= this.tempoAbertoMs) {}
 
     throw new CircuitBreakerOpenError();
killedBy: CircuitBreaker deve mudar para meio aberto após o período de recuperação
statusReason: Error: expect(received).not.toThrow()

Error name:    "CircuitBreakerOpenError"
Error message: "Circuit breaker aberto"

      102 |         }
      103 |       }
    > 104 |       throw new CircuitBreakerOpenError();

[Survived] BooleanLiteral
src/resilience/CircuitBreaker.js:38:14
 
     if (tempoDecorrido >= this.tempoAbertoMs) {
       this.estado = 'MEIO_ABERTO';
-      return true;
+      return false;
     }
 

[Killed] BlockStatement
src/resilience/CircuitBreaker.js:44:22
     throw new CircuitBreakerOpenError();
   }
 
-  registrarSucesso() {
-    if (this.estado === 'MEIO_ABERTO') {
-      this.fechar();
-      return;
-    }
-
-    if (this.estado === 'FECHADO') {
-      this.totalExecucoes += 1;
-      this.avaliarAbertura();
-    }
-  }
+  registrarSucesso() {}
 
   registrarFalha() {
killedBy: CircuitBreaker deve abrir quando a taxa de falhas ultrapassar 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ABERTO"
Received: "FECHADO"

[Killed] BlockStatement
src/resilience/CircuitBreaker.js:45:40
   }
 
   registrarSucesso() {
-    if (this.estado === 'MEIO_ABERTO') {
-      this.fechar();
-      return;
-    }
+    if (this.estado === 'MEIO_ABERTO') {}
 
     if (this.estado === 'FECHADO') {
killedBy: CircuitBreaker deve fechar novamente após sucesso no estado meio aberto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FECHADO"
Received: "MEIO_ABERTO"

[Killed] ConditionalExpression
src/resilience/CircuitBreaker.js:45:9
   }
 
   registrarSucesso() {
-    if (this.estado === 'MEIO_ABERTO') {
+    if (true) {
       this.fechar();
       return;
killedBy: CircuitBreaker deve abrir quando a taxa de falhas ultrapassar 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ABERTO"
Received: "FECHADO"

[Killed] BlockStatement
src/resilience/CircuitBreaker.js:50:36
       return;
     }
 
-    if (this.estado === 'FECHADO') {
-      this.totalExecucoes += 1;
-      this.avaliarAbertura();
-    }
+    if (this.estado === 'FECHADO') {}
   }
 
killedBy: CircuitBreaker deve abrir quando a taxa de falhas ultrapassar 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ABERTO"
Received: "FECHADO"

[Killed] EqualityOperator
src/resilience/CircuitBreaker.js:50:9
       return;
     }
 
-    if (this.estado === 'FECHADO') {
+    if (this.estado !== 'FECHADO') {
       this.totalExecucoes += 1;
       this.avaliarAbertura();
killedBy: CircuitBreaker deve abrir quando a taxa de falhas ultrapassar 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ABERTO"
Received: "FECHADO"

[Killed] AssignmentOperator
src/resilience/CircuitBreaker.js:51:7
     }
 
     if (this.estado === 'FECHADO') {
-      this.totalExecucoes += 1;
+      this.totalExecucoes -= 1;
       this.avaliarAbertura();
     }
killedBy: CircuitBreaker deve abrir quando a taxa de falhas ultrapassar 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ABERTO"
Received: "FECHADO"

[Killed] BlockStatement
src/resilience/CircuitBreaker.js:56:20
     }
   }
 
-  registrarFalha() {
-    if (this.estado === 'MEIO_ABERTO') {
-      this.abrir();
-      return;
-    }
-
-    if (this.estado === 'FECHADO') {
-      this.totalExecucoes += 1;
-      this.totalFalhas += 1;
-      this.avaliarAbertura();
-    }
-  }
+  registrarFalha() {}
 
   avaliarAbertura() {
killedBy: CircuitBreaker deve abrir quando a taxa de falhas ultrapassar 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ABERTO"
Received: "FECHADO"

[Killed] ConditionalExpression
src/resilience/CircuitBreaker.js:57:9
   }
 
   registrarFalha() {
-    if (this.estado === 'MEIO_ABERTO') {
+    if (true) {
       this.abrir();
       return;
killedBy: CircuitBreaker deve permanecer fechado quando a taxa de falhas for igual a 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FECHADO"
Received: "ABERTO"

[Killed] EqualityOperator
src/resilience/CircuitBreaker.js:57:9
   }
 
   registrarFalha() {
-    if (this.estado === 'MEIO_ABERTO') {
+    if (this.estado !== 'MEIO_ABERTO') {
       this.abrir();
       return;
killedBy: CircuitBreaker deve permanecer fechado quando a taxa de falhas for igual a 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FECHADO"
Received: "ABERTO"

[Killed] ConditionalExpression
src/resilience/CircuitBreaker.js:62:9
       return;
     }
 
-    if (this.estado === 'FECHADO') {
+    if (false) {
       this.totalExecucoes += 1;
       this.totalFalhas += 1;
killedBy: CircuitBreaker deve abrir quando a taxa de falhas ultrapassar 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ABERTO"
Received: "FECHADO"

[Killed] AssignmentOperator
src/resilience/CircuitBreaker.js:64:7
 
     if (this.estado === 'FECHADO') {
       this.totalExecucoes += 1;
-      this.totalFalhas += 1;
+      this.totalFalhas -= 1;
       this.avaliarAbertura();
     }
killedBy: CircuitBreaker deve abrir quando a taxa de falhas ultrapassar 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ABERTO"
Received: "FECHADO"

[Killed] BlockStatement
src/resilience/CircuitBreaker.js:69:21
     }
   }
 
-  avaliarAbertura() {
-    if (this.totalExecucoes < this.minimoAmostras) {
-      return;
-    }
-
-    const taxaFalhas =
-      this.totalFalhas / this.totalExecucoes;
-
-    if (taxaFalhas > this.limiteFalhas) {
-      this.abrir();
-    }
-  }
+  avaliarAbertura() {}
 
   abrir() {
killedBy: CircuitBreaker deve abrir quando a taxa de falhas ultrapassar 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ABERTO"
Received: "FECHADO"

[Killed] EqualityOperator
src/resilience/CircuitBreaker.js:70:9
   }
 
   avaliarAbertura() {
-    if (this.totalExecucoes < this.minimoAmostras) {
+    if (this.totalExecucoes >= this.minimoAmostras) {
       return;
     }
killedBy: CircuitBreaker deve permanecer fechado quando a taxa de falhas for igual a 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FECHADO"
Received: "ABERTO"

[Killed] ConditionalExpression
src/resilience/CircuitBreaker.js:70:9
   }
 
   avaliarAbertura() {
-    if (this.totalExecucoes < this.minimoAmostras) {
+    if (true) {
       return;
     }
killedBy: CircuitBreaker deve abrir quando a taxa de falhas ultrapassar 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ABERTO"
Received: "FECHADO"

[Killed] ArithmeticOperator
src/resilience/CircuitBreaker.js:75:7
     }
 
     const taxaFalhas =
-      this.totalFalhas / this.totalExecucoes;
+      this.totalFalhas * this.totalExecucoes;
 
     if (taxaFalhas > this.limiteFalhas) {
killedBy: CircuitBreaker deve permanecer fechado quando a taxa de falhas for igual a 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FECHADO"
Received: "ABERTO"

[Killed] EqualityOperator
src/resilience/CircuitBreaker.js:77:9
     const taxaFalhas =
       this.totalFalhas / this.totalExecucoes;
 
-    if (taxaFalhas > this.limiteFalhas) {
+    if (taxaFalhas >= this.limiteFalhas) {
       this.abrir();
     }
killedBy: CircuitBreaker deve permanecer fechado quando a taxa de falhas for igual a 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FECHADO"
Received: "ABERTO"

[Killed] BlockStatement
src/resilience/CircuitBreaker.js:77:41
     const taxaFalhas =
       this.totalFalhas / this.totalExecucoes;
 
-    if (taxaFalhas > this.limiteFalhas) {
-      this.abrir();
-    }
+    if (taxaFalhas > this.limiteFalhas) {}
   }
 
killedBy: CircuitBreaker deve abrir quando a taxa de falhas ultrapassar 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ABERTO"
Received: "FECHADO"

[Killed] BlockStatement
src/resilience/CircuitBreaker.js:82:11
     }
   }
 
-  abrir() {
-    this.estado = 'ABERTO';
-    this.abertoEm = this.agoraFn();
-  }
+  abrir() {}
 
   fechar() {
killedBy: CircuitBreaker deve abrir quando a taxa de falhas ultrapassar 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ABERTO"
Received: "FECHADO"

[Killed] BlockStatement
src/resilience/CircuitBreaker.js:87:12
     this.abertoEm = this.agoraFn();
   }
 
-  fechar() {
-    this.estado = 'FECHADO';
-    this.totalExecucoes = 0;
-    this.totalFalhas = 0;
-    this.abertoEm = null;
-  }
+  fechar() {}
 
   obterEstado() {
killedBy: CircuitBreaker deve fechar novamente após sucesso no estado meio aberto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FECHADO"
Received: "MEIO_ABERTO"

[Killed] StringLiteral
src/resilience/CircuitBreaker.js:88:19
   }
 
   fechar() {
-    this.estado = 'FECHADO';
+    this.estado = "";
     this.totalExecucoes = 0;
     this.totalFalhas = 0;
killedBy: CircuitBreaker deve fechar novamente após sucesso no estado meio aberto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FECHADO"
Received: ""

[Killed] BlockStatement
src/resilience/CircuitBreaker.js:94:17
     this.abertoEm = null;
   }
 
-  obterEstado() {
-    return this.estado;
-  }
+  obterEstado() {}
 }
 
killedBy: CircuitBreaker deve permanecer fechado quando a taxa de falhas for igual a 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FECHADO"
Received: undefined
