[Killed] BlockStatement
src/resilience/GatewayPagamentoResiliente.js:2:26
 ﻿class GatewayTimeoutError extends Error {
-  constructor(timeoutMs) {
-    super(
-      `Timeout no gateway de pagamento após ${timeoutMs}ms`
-    );
-
-    this.name = 'GatewayTimeoutError';
-    this.code = 'GATEWAY_TIMEOUT';
-    this.timeoutMs = timeoutMs;
-  }
+  constructor(timeoutMs) {}
 }
 
killedBy: GatewayPagamentoResiliente timeout deve interromper a cobrança quando o gateway exceder 2000ms
statusReason: ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
src/resilience/GatewayPagamentoResiliente.js:21:6
     maxTentativas = 4,
     intervaloEsperaMs = 500,
     esperaFn
-  }) {
-    this.gatewayPagamento = gatewayPagamento;
-    this.timeoutMs = timeoutMs;
-    this.maxTentativas = maxTentativas;
-    this.intervaloEsperaMs = intervaloEsperaMs;
-
-    this.circuitBreaker =
-      circuitBreaker || {
-        verificarPermissao: () => true,
-        registrarSucesso: () => {},
-        registrarFalha: () => {}
-      };
-
-    this.esperaFn =
-      esperaFn ||
-      ((tempoMs) =>
-        new Promise((resolve) => {
-          setTimeout(resolve, tempoMs);
-        }));
-  }
+  }) {}
 
   async cobrar(valor, cartao) {
killedBy: GatewayPagamentoResiliente timeout deve interromper a cobrança quando o gateway exceder 2000ms
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Timeout no gateway de pagamento após 2000ms"

Received function did not throw

[Killed] ConditionalExpression
src/resilience/GatewayPagamentoResiliente.js:28:7
     this.intervaloEsperaMs = intervaloEsperaMs;
 
     this.circuitBreaker =
-      circuitBreaker || {
-        verificarPermissao: () => true,
-        registrarSucesso: () => {},
-        registrarFalha: () => {}
-      };
+      true;
 
     this.esperaFn =
killedBy: GatewayPagamentoResiliente timeout deve interromper a cobrança quando o gateway exceder 2000ms
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Timeout no gateway de pagamento após 2000ms"
Received message:   "this.circuitBreaker.verificarPermissao is not a function"

      108 |         } else {
      109 |           stryCov_9fa48("117");
    > 110 |           this.circuitBreaker.verificarPermissao();

[Killed] ConditionalExpression
src/resilience/GatewayPagamentoResiliente.js:28:7
     this.intervaloEsperaMs = intervaloEsperaMs;
 
     this.circuitBreaker =
-      circuitBreaker || {
-        verificarPermissao: () => true,
-        registrarSucesso: () => {},
-        registrarFalha: () => {}
-      };
+      false;
 
     this.esperaFn =
killedBy: GatewayPagamentoResiliente timeout deve interromper a cobrança quando o gateway exceder 2000ms
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Timeout no gateway de pagamento após 2000ms"
Received message:   "this.circuitBreaker.verificarPermissao is not a function"

      108 |         } else {
      109 |           stryCov_9fa48("117");
    > 110 |           this.circuitBreaker.verificarPermissao();

[Survived] BooleanLiteral
src/resilience/GatewayPagamentoResiliente.js:29:35
 
     this.circuitBreaker =
       circuitBreaker || {
-        verificarPermissao: () => true,
+        verificarPermissao: () => false,
         registrarSucesso: () => {},
         registrarFalha: () => {}

[Survived] ArrowFunction
src/resilience/GatewayPagamentoResiliente.js:29:29
 
     this.circuitBreaker =
       circuitBreaker || {
-        verificarPermissao: () => true,
+        verificarPermissao: () => undefined,
         registrarSucesso: () => {},
         registrarFalha: () => {}

[Killed] ConditionalExpression
src/resilience/GatewayPagamentoResiliente.js:35:7
       };
 
     this.esperaFn =
-      esperaFn ||
-      ((tempoMs) =>
-        new Promise((resolve) => {
-          setTimeout(resolve, tempoMs);
-        }));
+      true;
   }
 
killedBy: GatewayPagamentoResiliente retry deve tentar novamente após falhas transitórias e retornar sucesso
statusReason: TypeError: this.esperaFn is not a function

[Killed] LogicalOperator
src/resilience/GatewayPagamentoResiliente.js:35:7
       };
 
     this.esperaFn =
-      esperaFn ||
-      ((tempoMs) =>
-        new Promise((resolve) => {
-          setTimeout(resolve, tempoMs);
-        }));
+      esperaFn && (tempoMs => new Promise(resolve => {
+  setTimeout(resolve, tempoMs);
+}));
   }
 
killedBy: GatewayPagamentoResiliente retry deve tentar novamente após falhas transitórias e retornar sucesso
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Survived] ArrowFunction
src/resilience/GatewayPagamentoResiliente.js:36:8
 
     this.esperaFn =
       esperaFn ||
-      ((tempoMs) =>
-        new Promise((resolve) => {
-          setTimeout(resolve, tempoMs);
-        }));
+      (() => undefined);
   }
 

[NoCoverage] BlockStatement
src/resilience/GatewayPagamentoResiliente.js:37:34
     this.esperaFn =
       esperaFn ||
       ((tempoMs) =>
-        new Promise((resolve) => {
-          setTimeout(resolve, tempoMs);
-        }));
+        new Promise((resolve) => {}));
   }
 

[Killed] ConditionalExpression
src/resilience/GatewayPagamentoResiliente.js:47:7
 
     for (
       let tentativa = 1;
-      tentativa <= this.maxTentativas;
+      false;
       tentativa += 1
     ) {
killedBy: GatewayPagamentoResiliente timeout deve interromper a cobrança quando o gateway exceder 2000ms
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Timeout no gateway de pagamento após 2000ms"

Received function did not throw

[Killed] EqualityOperator
src/resilience/GatewayPagamentoResiliente.js:47:7
 
     for (
       let tentativa = 1;
-      tentativa <= this.maxTentativas;
+      tentativa < this.maxTentativas;
       tentativa += 1
     ) {
killedBy: GatewayPagamentoResiliente timeout deve interromper a cobrança quando o gateway exceder 2000ms
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Timeout no gateway de pagamento após 2000ms"

Received function did not throw

[Timeout] AssignmentOperator
src/resilience/GatewayPagamentoResiliente.js:48:7
     for (
       let tentativa = 1;
       tentativa <= this.maxTentativas;
-      tentativa += 1
+      tentativa -= 1
     ) {
       this.circuitBreaker.verificarPermissao();

[Killed] BlockStatement
src/resilience/GatewayPagamentoResiliente.js:52:11
     ) {
       this.circuitBreaker.verificarPermissao();
 
-      try {
-        const resultado = await this.executarComTimeout(
-          valor,
-          cartao
-        );
-
-        this.circuitBreaker.registrarSucesso();
-
-        return resultado;
-      } catch (erro) {
+      try {} catch (erro) {
         ultimaFalha = erro;
 
killedBy: GatewayPagamentoResiliente timeout deve interromper a cobrança quando o gateway exceder 2000ms
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Timeout no gateway de pagamento após 2000ms"

Received function did not throw

[Killed] BlockStatement
src/resilience/GatewayPagamentoResiliente.js:61:22
         this.circuitBreaker.registrarSucesso();
 
         return resultado;
-      } catch (erro) {
-        ultimaFalha = erro;
-
-        const falhaTransitoria =
-          this.ehFalhaTransitoria(erro);
-
-        if (falhaTransitoria) {
-          this.circuitBreaker.registrarFalha();
-        }
-
-        const possuiNovaTentativa =
-          tentativa < this.maxTentativas;
-
-        const deveTentarNovamente =
-          possuiNovaTentativa &&
-          falhaTransitoria;
-
-        if (!deveTentarNovamente) {
-          throw erro;
-        }
-
-        await this.esperaFn(
-          this.intervaloEsperaMs
-        );
-      }
+      } catch (erro) {}
     }
 
killedBy: GatewayPagamentoResiliente timeout deve interromper a cobrança quando o gateway exceder 2000ms
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Timeout no gateway de pagamento após 2000ms"

Received function did not throw

[Survived] ConditionalExpression
src/resilience/GatewayPagamentoResiliente.js:67:13
         const falhaTransitoria =
           this.ehFalhaTransitoria(erro);
 
-        if (falhaTransitoria) {
+        if (true) {
           this.circuitBreaker.registrarFalha();
         }

[Survived] ConditionalExpression
src/resilience/GatewayPagamentoResiliente.js:67:13
         const falhaTransitoria =
           this.ehFalhaTransitoria(erro);
 
-        if (falhaTransitoria) {
+        if (false) {
           this.circuitBreaker.registrarFalha();
         }

[Killed] EqualityOperator
src/resilience/GatewayPagamentoResiliente.js:72:11
         }
 
         const possuiNovaTentativa =
-          tentativa < this.maxTentativas;
+          tentativa <= this.maxTentativas;
 
         const deveTentarNovamente =
killedBy: GatewayPagamentoResiliente timeout deve interromper a cobrança quando o gateway exceder 2000ms
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/resilience/GatewayPagamentoResiliente.js:72:11
         }
 
         const possuiNovaTentativa =
-          tentativa < this.maxTentativas;
+          false;
 
         const deveTentarNovamente =
killedBy: GatewayPagamentoResiliente retry deve tentar novamente após falhas transitórias e retornar sucesso
statusReason: Error: Conexão reiniciada

[Killed] ConditionalExpression
src/resilience/GatewayPagamentoResiliente.js:75:11
           tentativa < this.maxTentativas;
 
         const deveTentarNovamente =
-          possuiNovaTentativa &&
-          falhaTransitoria;
+          false;
 
         if (!deveTentarNovamente) {
killedBy: GatewayPagamentoResiliente retry deve tentar novamente após falhas transitórias e retornar sucesso
statusReason: Error: Conexão reiniciada

[Killed] LogicalOperator
src/resilience/GatewayPagamentoResiliente.js:75:11
           tentativa < this.maxTentativas;
 
         const deveTentarNovamente =
-          possuiNovaTentativa &&
-          falhaTransitoria;
+          possuiNovaTentativa || falhaTransitoria;
 
         if (!deveTentarNovamente) {
killedBy: GatewayPagamentoResiliente timeout deve interromper a cobrança quando o gateway exceder 2000ms
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BooleanLiteral
src/resilience/GatewayPagamentoResiliente.js:78:13
           possuiNovaTentativa &&
           falhaTransitoria;
 
-        if (!deveTentarNovamente) {
+        if (deveTentarNovamente) {
           throw erro;
         }
killedBy: GatewayPagamentoResiliente timeout deve interromper a cobrança quando o gateway exceder 2000ms
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/resilience/GatewayPagamentoResiliente.js:78:13
           possuiNovaTentativa &&
           falhaTransitoria;
 
-        if (!deveTentarNovamente) {
+        if (true) {
           throw erro;
         }
killedBy: GatewayPagamentoResiliente retry deve tentar novamente após falhas transitórias e retornar sucesso
statusReason: Error: Conexão reiniciada

[Killed] ArrowFunction
src/resilience/GatewayPagamentoResiliente.js:96:13
 
     const chamadaGateway = Promise
       .resolve()
-      .then(() =>
-        this.gatewayPagamento.cobrar(
-          valor,
-          cartao
-        )
+      .then(() => undefined
       );
 
killedBy: GatewayPagamentoResiliente timeout deve interromper a cobrança quando o gateway exceder 2000ms
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/resilience/GatewayPagamentoResiliente.js:104:24
       );
 
     const limiteDeTempo = new Promise(
-      (_, rejeitar) => {
-        identificadorTimeout = setTimeout(() => {
-          rejeitar(
-            new GatewayTimeoutError(
-              this.timeoutMs
-            )
-          );
-        }, this.timeoutMs);
-      }
+      (_, rejeitar) => {}
     );
 
killedBy: GatewayPagamentoResiliente timeout deve interromper a cobrança quando o gateway exceder 2000ms
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/resilience/GatewayPagamentoResiliente.js:105:49
 
     const limiteDeTempo = new Promise(
       (_, rejeitar) => {
-        identificadorTimeout = setTimeout(() => {
-          rejeitar(
-            new GatewayTimeoutError(
-              this.timeoutMs
-            )
-          );
-        }, this.timeoutMs);
+        identificadorTimeout = setTimeout(() => {}, this.timeoutMs);
       }
     );
killedBy: GatewayPagamentoResiliente timeout deve interromper a cobrança quando o gateway exceder 2000ms
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Timeout] ArrayDeclaration
src/resilience/GatewayPagamentoResiliente.js:116:33
     );
 
     try {
-      return await Promise.race([
-        chamadaGateway,
-        limiteDeTempo
-      ]);
+      return await Promise.race([]);
     } finally {
       clearTimeout(identificadorTimeout);

[Survived] BlockStatement
src/resilience/GatewayPagamentoResiliente.js:120:15
         chamadaGateway,
         limiteDeTempo
       ]);
-    } finally {
-      clearTimeout(identificadorTimeout);
-    }
+    } finally {}
   }
 

[Killed] BlockStatement
src/resilience/GatewayPagamentoResiliente.js:125:28
     }
   }
 
-  ehFalhaTransitoria(erro) {
-    if (erro instanceof GatewayTimeoutError) {
-      return true;
-    }
-
-    const codigosTransitorios = [
-      'ECONNRESET',
-      'ECONNREFUSED',
-      'ETIMEDOUT',
-      'EHOSTUNREACH',
-      'ENETUNREACH'
-    ];
-
-    return codigosTransitorios.includes(
-      erro?.code
-    );
-  }
+  ehFalhaTransitoria(erro) {}
 }
 
killedBy: GatewayPagamentoResiliente retry deve tentar novamente após falhas transitórias e retornar sucesso
statusReason: Error: Conexão reiniciada

[Survived] ConditionalExpression
src/resilience/GatewayPagamentoResiliente.js:126:9
   }
 
   ehFalhaTransitoria(erro) {
-    if (erro instanceof GatewayTimeoutError) {
+    if (true) {
       return true;
     }

[Survived] ConditionalExpression
src/resilience/GatewayPagamentoResiliente.js:126:9
   }
 
   ehFalhaTransitoria(erro) {
-    if (erro instanceof GatewayTimeoutError) {
+    if (false) {
       return true;
     }

[Survived] BooleanLiteral
src/resilience/GatewayPagamentoResiliente.js:127:14
 
   ehFalhaTransitoria(erro) {
     if (erro instanceof GatewayTimeoutError) {
-      return true;
+      return false;
     }
 

[Killed] StringLiteral
src/resilience/GatewayPagamentoResiliente.js:131:7
     }
 
     const codigosTransitorios = [
-      'ECONNRESET',
+      "",
       'ECONNREFUSED',
       'ETIMEDOUT',
killedBy: GatewayPagamentoResiliente retry deve tentar novamente após falhas transitórias e retornar sucesso
statusReason: Error: Conexão reiniciada

[Survived] StringLiteral
src/resilience/GatewayPagamentoResiliente.js:133:7
     const codigosTransitorios = [
       'ECONNRESET',
       'ECONNREFUSED',
-      'ETIMEDOUT',
+      "",
       'EHOSTUNREACH',
       'ENETUNREACH'

[Survived] OptionalChaining
src/resilience/GatewayPagamentoResiliente.js:139:7
     ];
 
     return codigosTransitorios.includes(
-      erro?.code
+      erro.code
     );
   }
