[Killed] BlockStatement
src/services/CheckoutServiceRefactored.js:7:6
     pedidoRepository,
     emailService,
     pedidoValidator
-  }) {
-    this.gatewayPagamento = gatewayPagamento;
-    this.pedidoRepository = pedidoRepository;
-    this.emailService = emailService;
-    this.pedidoValidator = pedidoValidator;
-  }
+  }) {}
 
   async processar(pedido) {
killedBy: POST /checkout deve retornar 200 quando o pagamento for aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
src/services/CheckoutServiceRefactored.js:14:27
     this.pedidoValidator = pedidoValidator;
   }
 
-  async processar(pedido) {
-    this.pedidoValidator.validar(pedido);
-
-    let respostaPagamento;
-
-    try {
-      respostaPagamento =
-        await this.gatewayPagamento.cobrar(
-          pedido.valor,
-          pedido.cartao
-        );
-    } catch (erro) {
-      return this.processarErroGateway(pedido, erro);
-    }
-
-    if (respostaPagamento.status === 'APROVADO') {
-      return this.processarPagamentoAprovado(pedido);
-    }
-
-    return this.processarPagamentoRecusado(pedido);
-  }
+  async processar(pedido) {}
 
   async processarPagamentoAprovado(pedido) {
killedBy: POST /checkout deve retornar 200 quando o pagamento for aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
src/services/CheckoutServiceRefactored.js:19:9
 
     let respostaPagamento;
 
-    try {
-      respostaPagamento =
-        await this.gatewayPagamento.cobrar(
-          pedido.valor,
-          pedido.cartao
-        );
-    } catch (erro) {
+    try {} catch (erro) {
       return this.processarErroGateway(pedido, erro);
     }
killedBy: POST /checkout deve retornar 200 quando o pagamento for aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
src/services/CheckoutServiceRefactored.js:25:20
           pedido.valor,
           pedido.cartao
         );
-    } catch (erro) {
-      return this.processarErroGateway(pedido, erro);
-    }
+    } catch (erro) {}
 
     if (respostaPagamento.status === 'APROVADO') {
killedBy: POST /checkout deve retornar 500 quando ocorrer erro no gateway
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "erro": "Pagamento não aprovado",
+   "erro": "Erro interno no checkout",

[Killed] ConditionalExpression
src/services/CheckoutServiceRefactored.js:29:9
       return this.processarErroGateway(pedido, erro);
     }
 
-    if (respostaPagamento.status === 'APROVADO') {
+    if (false) {
       return this.processarPagamentoAprovado(pedido);
     }
killedBy: POST /checkout deve retornar 200 quando o pagamento for aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
src/services/CheckoutServiceRefactored.js:29:50
       return this.processarErroGateway(pedido, erro);
     }
 
-    if (respostaPagamento.status === 'APROVADO') {
-      return this.processarPagamentoAprovado(pedido);
-    }
+    if (respostaPagamento.status === 'APROVADO') {}
 
     return this.processarPagamentoRecusado(pedido);
killedBy: POST /checkout deve retornar 200 quando o pagamento for aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
src/services/CheckoutServiceRefactored.js:36:44
     return this.processarPagamentoRecusado(pedido);
   }
 
-  async processarPagamentoAprovado(pedido) {
-    const pedidoProcessado = this.criarPedidoComStatus(
-      pedido,
-      'PROCESSADO'
-    );
-
-    const pedidoSalvo =
-      await this.pedidoRepository.salvar(pedidoProcessado);
-
-    this.enviarConfirmacaoSemBloquear(pedidoSalvo);
-
-    return pedidoSalvo;
-  }
+  async processarPagamentoAprovado(pedido) {}
 
   async processarPagamentoRecusado(pedido) {
killedBy: POST /checkout deve retornar 200 quando o pagamento for aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
src/services/CheckoutServiceRefactored.js:50:44
     return pedidoSalvo;
   }
 
-  async processarPagamentoRecusado(pedido) {
-    const pedidoRecusado = this.criarPedidoComStatus(
-      pedido,
-      'FALHOU'
-    );
-
-    await this.pedidoRepository.salvar(pedidoRecusado);
-
-    return null;
-  }
+  async processarPagamentoRecusado(pedido) {}
 
   async processarErroGateway(pedido, erro) {
killedBy: POST /checkout deve retornar 500 quando o pagamento for recusado
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "FALHOU"}

Number of calls: 0

[Killed] BlockStatement
src/services/CheckoutServiceRefactored.js:61:44
     return null;
   }
 
-  async processarErroGateway(pedido, erro) {
-    console.error(
-      'Falha no gateway de pagamento:',
-      erro.message
-    );
-
-    const pedidoComErro = this.criarPedidoComStatus(
-      pedido,
-      'ERRO_GATEWAY'
-    );
-
-    await this.pedidoRepository.salvar(pedidoComErro);
-
-    return null;
-  }
+  async processarErroGateway(pedido, erro) {}
 
   criarPedidoComStatus(pedido, status) {
killedBy: POST /checkout deve retornar 500 quando ocorrer erro no gateway
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "ERRO_GATEWAY"}

Number of calls: 0

[Killed] StringLiteral
src/services/CheckoutServiceRefactored.js:63:7
 
   async processarErroGateway(pedido, erro) {
     console.error(
-      'Falha no gateway de pagamento:',
+      "",
       erro.message
     );
killedBy: CheckoutServiceRefactored deve salvar como ERRO_GATEWAY quando ocorrer falha de infraestrutura
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Falha no gateway de pagamento:", "ECONNRESET"
Received: "", "ECONNRESET"

Number of calls: 1

[Killed] StringLiteral
src/services/CheckoutServiceRefactored.js:69:7
 
     const pedidoComErro = this.criarPedidoComStatus(
       pedido,
-      'ERRO_GATEWAY'
+      ""
     );
 
killedBy: CheckoutServiceRefactored deve salvar como ERRO_GATEWAY quando ocorrer falha de infraestrutura
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "ERRO_GATEWAY"}
Received: {"cartao": {"cvv": "123", "numero": "4111111111111111", "validade": "12/30"}, "clienteEmail": "cliente@entregasja.com", "status": "", "valor": 150}

Number of calls: 1

[Killed] BlockStatement
src/services/CheckoutServiceRefactored.js:77:40
     return null;
   }
 
-  criarPedidoComStatus(pedido, status) {
-    return {
-      ...pedido,
-      cartao: {
-        ...pedido.cartao
-      },
-      status
-    };
-  }
+  criarPedidoComStatus(pedido, status) {}
 
   enviarConfirmacaoSemBloquear(pedido) {
killedBy: POST /checkout deve retornar 200 quando o pagamento for aprovado
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- ObjectContaining {
-   "clienteEmail": "cliente@entregasja.com",
+ Object {

[Killed] BlockStatement
src/services/CheckoutServiceRefactored.js:87:40
     };
   }
 
-  enviarConfirmacaoSemBloquear(pedido) {
-    try {
-      const envio = this.emailService.enviarConfirmacao(
-        pedido.clienteEmail,
-        'Pagamento Aprovado'
-      );
-
-      Promise.resolve(envio).catch((erro) => {
-        console.error(
-          'Falha ao enviar confirmação:',
-          erro.message
-        );
-      });
-    } catch (erro) {
-      console.error(
-        'Falha ao enviar confirmação:',
-        erro.message
-      );
-    }
-  }
+  enviarConfirmacaoSemBloquear(pedido) {}
 }
 
killedBy: POST /checkout deve retornar 200 quando o pagamento for aprovado
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/services/CheckoutServiceRefactored.js:88:9
   }
 
   enviarConfirmacaoSemBloquear(pedido) {
-    try {
-      const envio = this.emailService.enviarConfirmacao(
-        pedido.clienteEmail,
-        'Pagamento Aprovado'
-      );
-
-      Promise.resolve(envio).catch((erro) => {
-        console.error(
-          'Falha ao enviar confirmação:',
-          erro.message
-        );
-      });
-    } catch (erro) {
+    try {} catch (erro) {
       console.error(
         'Falha ao enviar confirmação:',
killedBy: POST /checkout deve retornar 200 quando o pagamento for aprovado
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
src/services/CheckoutServiceRefactored.js:91:9
     try {
       const envio = this.emailService.enviarConfirmacao(
         pedido.clienteEmail,
-        'Pagamento Aprovado'
+        ""
       );
 
killedBy: CheckoutServiceRefactored deve processar, salvar e notificar quando o pagamento for aprovado
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "cliente@entregasja.com", "Pagamento Aprovado"
Received: "cliente@entregasja.com", ""

Number of calls: 1

[Killed] BlockStatement
src/services/CheckoutServiceRefactored.js:94:46
         'Pagamento Aprovado'
       );
 
-      Promise.resolve(envio).catch((erro) => {
-        console.error(
-          'Falha ao enviar confirmação:',
-          erro.message
-        );
-      });
+      Promise.resolve(envio).catch((erro) => {});
     } catch (erro) {
       console.error(
killedBy: CheckoutServiceRefactored falha no e-mail não deve alterar o resultado do checkout
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Falha ao enviar confirmação:", "Servidor de e-mail indisponível"

Number of calls: 0

[Killed] StringLiteral
src/services/CheckoutServiceRefactored.js:96:11
 
       Promise.resolve(envio).catch((erro) => {
         console.error(
-          'Falha ao enviar confirmação:',
+          "",
           erro.message
         );
killedBy: CheckoutServiceRefactored falha no e-mail não deve alterar o resultado do checkout
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Falha ao enviar confirmação:", "Servidor de e-mail indisponível"
Received: "", "Servidor de e-mail indisponível"

Number of calls: 1

[NoCoverage] BlockStatement
src/services/CheckoutServiceRefactored.js:100:20
           erro.message
         );
       });
-    } catch (erro) {
-      console.error(
-        'Falha ao enviar confirmação:',
-        erro.message
-      );
-    }
+    } catch (erro) {}
   }
 }

[Killed] ObjectLiteral
src/services/CheckoutServiceRefactored.js:109:18
   }
 }
 
-module.exports = {
-  CheckoutServiceRefactored
-};
+module.exports = {};
 
killedBy: POST /checkout deve retornar 200 quando o pagamento for aprovado
statusReason: TypeError: CheckoutServiceRefactored is not a constructor
