[Killed] BlockStatement
src/services/PedidoConsultaService.js:6:6
     pedidoRepository,
     cache,
     ttlSegundos = 60
-  }) {
-    this.pedidoRepository = pedidoRepository;
-    this.cache = cache;
-    this.ttlSegundos = ttlSegundos;
-    this.consultasEmAndamento = new Map();
-  }
+  }) {}
 
   async buscarPorId(idPedido) {
killedBy: PedidoConsultaService deve agrupar consultas simultâneas quando o cache estiver vazio
statusReason: TypeError: Cannot read properties of undefined (reading 'buscar')

[Killed] ConditionalExpression
src/services/PedidoConsultaService.js:20:9
       chaveCache
     );
 
-    if (pedidoEmCache) {
+    if (true) {
       return pedidoEmCache;
     }
killedBy: PedidoConsultaService deve agrupar consultas simultâneas quando o cache estiver vazio
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"clienteEmail": "cliente@entregasja.com", "id": 1001, "status": "PROCESSADO", "valor": 150}
Received: null

[Killed] ConditionalExpression
src/services/PedidoConsultaService.js:20:9
       chaveCache
     );
 
-    if (pedidoEmCache) {
+    if (false) {
       return pedidoEmCache;
     }
killedBy: PedidoConsultaService deve retornar o pedido do cache sem consultar o banco
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"clienteEmail": "cliente@entregasja.com", "id": 1001, "status": "PROCESSADO", "valor": 150}
Received: undefined

[Killed] ConditionalExpression
src/services/PedidoConsultaService.js:24:9
       return pedidoEmCache;
     }
 
-    if (this.consultasEmAndamento.has(chaveCache)) {
+    if (false) {
       return this.consultasEmAndamento.get(
         chaveCache
killedBy: PedidoConsultaService deve agrupar consultas simultâneas quando o cache estiver vazio
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 100

[Killed] ConditionalExpression
src/services/PedidoConsultaService.js:24:9
       return pedidoEmCache;
     }
 
-    if (this.consultasEmAndamento.has(chaveCache)) {
+    if (true) {
       return this.consultasEmAndamento.get(
         chaveCache
killedBy: PedidoConsultaService deve agrupar consultas simultâneas quando o cache estiver vazio
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"clienteEmail": "cliente@entregasja.com", "id": 1001, "status": "PROCESSADO", "valor": 150}
Received: undefined

[Killed] BlockStatement
src/services/PedidoConsultaService.js:40:9
       consulta
     );
 
-    try {
-      return await consulta;
-    } finally {
+    try {} finally {
       this.consultasEmAndamento.delete(
         chaveCache
killedBy: PedidoConsultaService deve agrupar consultas simultâneas quando o cache estiver vazio
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"clienteEmail": "cliente@entregasja.com", "id": 1001, "status": "PROCESSADO", "valor": 150}
Received: undefined

[Survived] BlockStatement
src/services/PedidoConsultaService.js:42:15
 
     try {
       return await consulta;
-    } finally {
-      this.consultasEmAndamento.delete(
-        chaveCache
-      );
-    }
+    } finally {}
   }
 

[Killed] BlockStatement
src/services/PedidoConsultaService.js:52:5
   async buscarNoBancoEAtualizarCache(
     idPedido,
     chaveCache
-  ) {
-    const pedido =
-      await this.pedidoRepository.buscarPorId(
-        idPedido
-      );
-
-    if (pedido) {
-      await this.cache.salvar(
-        chaveCache,
-        pedido,
-        this.ttlSegundos
-      );
-    }
-
-    return pedido;
-  }
+  ) {}
 
   criarChaveCache(idPedido) {
killedBy: PedidoConsultaService deve agrupar consultas simultâneas quando o cache estiver vazio
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"clienteEmail": "cliente@entregasja.com", "id": 1001, "status": "PROCESSADO", "valor": 150}
Received: undefined

[Killed] BlockStatement
src/services/PedidoConsultaService.js:58:17
         idPedido
       );
 
-    if (pedido) {
-      await this.cache.salvar(
-        chaveCache,
-        pedido,
-        this.ttlSegundos
-      );
-    }
+    if (pedido) {}
 
     return pedido;
killedBy: PedidoConsultaService deve agrupar consultas simultâneas quando o cache estiver vazio
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/services/PedidoConsultaService.js:58:9
         idPedido
       );
 
-    if (pedido) {
+    if (false) {
       await this.cache.salvar(
         chaveCache,
killedBy: PedidoConsultaService deve agrupar consultas simultâneas quando o cache estiver vazio
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/services/PedidoConsultaService.js:69:29
     return pedido;
   }
 
-  criarChaveCache(idPedido) {
-    return `pedido:${idPedido}`;
-  }
+  criarChaveCache(idPedido) {}
 }
 
killedBy: PedidoConsultaService deve agrupar consultas simultâneas quando o cache estiver vazio
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "pedido:1001",
+ undefined,
  {"clienteEmail": "cliente@entregasja.com", "id": 1001, "status": "PROCESSADO", "valor": 150},
