[Killed] BlockStatement
src/validation/PedidoValidator.js:2:19
 ﻿class PedidoValidator {
-  validar(pedido) {
-    this.validarEmail(pedido?.clienteEmail);
-    this.validarValor(pedido?.valor);
-    this.validarCartao(pedido?.cartao);
-
-    return true;
-  }
+  validar(pedido) {}
 
   validarEmail(email) {
killedBy: CheckoutServiceRefactored não deve chamar dependências quando o pedido for inválido
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "E-mail do cliente inválido"
Received message:   "Cannot read properties of undefined (reading 'status')"

      85 |         }
      86 |       }
    > 87 |       if (stryMutAct_9fa48("160") ? respostaPagamento.status !== 'APROVADO' : stryMutAct_9fa48("159") ? false : stryMutAct_9fa48("158") ? true : (stryCov_9fa48("158", "159

[Survived] OptionalChaining
src/validation/PedidoValidator.js:3:23
 ﻿class PedidoValidator {
   validar(pedido) {
-    this.validarEmail(pedido?.clienteEmail);
+    this.validarEmail(pedido.clienteEmail);
     this.validarValor(pedido?.valor);
     this.validarCartao(pedido?.cartao);

[Survived] OptionalChaining
src/validation/PedidoValidator.js:4:23
 ﻿class PedidoValidator {
   validar(pedido) {
     this.validarEmail(pedido?.clienteEmail);
-    this.validarValor(pedido?.valor);
+    this.validarValor(pedido.valor);
     this.validarCartao(pedido?.cartao);
 

[Survived] OptionalChaining
src/validation/PedidoValidator.js:5:24
   validar(pedido) {
     this.validarEmail(pedido?.clienteEmail);
     this.validarValor(pedido?.valor);
-    this.validarCartao(pedido?.cartao);
+    this.validarCartao(pedido.cartao);
 
     return true;

[Killed] BlockStatement
src/validation/PedidoValidator.js:10:23
     return true;
   }
 
-  validarEmail(email) {
-    const padraoEmail = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-
-    if (
-      typeof email !== 'string' ||
-      !padraoEmail.test(email.trim())
-    ) {
-      throw new Error('E-mail do cliente inválido');
-    }
-  }
+  validarEmail(email) {}
 
   validarValor(valor) {
killedBy: PedidoValidator deve rejeitar e-mail inválido: undefined
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "E-mail do cliente inválido"

Received function did not throw

[Killed] Regex
src/validation/PedidoValidator.js:11:25
   }
 
   validarEmail(email) {
-    const padraoEmail = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+    const padraoEmail = /^[^\S@]+@[^\s@]+\.[^\s@]+$/;
 
     if (
killedBy: POST /checkout deve retornar 200 quando o pagamento for aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] Regex
src/validation/PedidoValidator.js:11:25
   }
 
   validarEmail(email) {
-    const padraoEmail = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+    const padraoEmail = /^[^\s@]+@[^\s@]+\.[^\S@]+$/;
 
     if (
killedBy: POST /checkout deve retornar 200 quando o pagamento for aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
src/validation/PedidoValidator.js:14:7
     const padraoEmail = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
 
     if (
-      typeof email !== 'string' ||
-      !padraoEmail.test(email.trim())
+      true
     ) {
       throw new Error('E-mail do cliente inválido');
killedBy: POST /checkout deve retornar 200 quando o pagamento for aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] EqualityOperator
src/validation/PedidoValidator.js:14:7
     const padraoEmail = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
 
     if (
-      typeof email !== 'string' ||
+      typeof email === 'string' ||
       !padraoEmail.test(email.trim())
     ) {
killedBy: POST /checkout deve retornar 200 quando o pagamento for aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BooleanLiteral
src/validation/PedidoValidator.js:15:7
 
     if (
       typeof email !== 'string' ||
-      !padraoEmail.test(email.trim())
+      padraoEmail.test(email.trim())
     ) {
       throw new Error('E-mail do cliente inválido');
killedBy: POST /checkout deve retornar 200 quando o pagamento for aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Survived] MethodExpression
src/validation/PedidoValidator.js:15:25
 
     if (
       typeof email !== 'string' ||
-      !padraoEmail.test(email.trim())
+      !padraoEmail.test(email)
     ) {
       throw new Error('E-mail do cliente inválido');

[Killed] BlockStatement
src/validation/PedidoValidator.js:16:7
     if (
       typeof email !== 'string' ||
       !padraoEmail.test(email.trim())
-    ) {
-      throw new Error('E-mail do cliente inválido');
-    }
+    ) {}
   }
 
killedBy: POST /checkout deve retornar 400 sem chamar dependências quando o pedido for inválido
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] BlockStatement
src/validation/PedidoValidator.js:21:23
     }
   }
 
-  validarValor(valor) {
-    if (
-      typeof valor !== 'number' ||
-      !Number.isFinite(valor) ||
-      valor <= 0
-    ) {
-      throw new Error('Valor do pedido inválido');
-    }
-  }
+  validarValor(valor) {}
 
   validarCartao(cartao) {
killedBy: PedidoValidator deve rejeitar valor inválido: undefined
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Valor do pedido inválido"

Received function did not throw

[Killed] ConditionalExpression
src/validation/PedidoValidator.js:23:7
 
   validarValor(valor) {
     if (
-      typeof valor !== 'number' ||
-      !Number.isFinite(valor) ||
-      valor <= 0
+      false
     ) {
       throw new Error('Valor do pedido inválido');
killedBy: PedidoValidator deve rejeitar valor inválido: undefined
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Valor do pedido inválido"

Received function did not throw

[Killed] ConditionalExpression
src/validation/PedidoValidator.js:23:7
 
   validarValor(valor) {
     if (
-      typeof valor !== 'number' ||
-      !Number.isFinite(valor) ||
+      false ||
       valor <= 0
     ) {
killedBy: PedidoValidator deve rejeitar valor inválido: undefined
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Valor do pedido inválido"

Received function did not throw

[Killed] BooleanLiteral
src/validation/PedidoValidator.js:24:7
   validarValor(valor) {
     if (
       typeof valor !== 'number' ||
-      !Number.isFinite(valor) ||
+      Number.isFinite(valor) ||
       valor <= 0
     ) {
killedBy: POST /checkout deve retornar 200 quando o pagamento for aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] EqualityOperator
src/validation/PedidoValidator.js:25:7
     if (
       typeof valor !== 'number' ||
       !Number.isFinite(valor) ||
-      valor <= 0
+      valor < 0
     ) {
       throw new Error('Valor do pedido inválido');
killedBy: PedidoValidator deve rejeitar valor inválido: 0
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Valor do pedido inválido"

Received function did not throw

[Killed] ConditionalExpression
src/validation/PedidoValidator.js:25:7
     if (
       typeof valor !== 'number' ||
       !Number.isFinite(valor) ||
-      valor <= 0
+      false
     ) {
       throw new Error('Valor do pedido inválido');
killedBy: PedidoValidator deve rejeitar valor inválido: 0
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Valor do pedido inválido"

Received function did not throw

[Killed] BlockStatement
src/validation/PedidoValidator.js:26:7
       typeof valor !== 'number' ||
       !Number.isFinite(valor) ||
       valor <= 0
-    ) {
-      throw new Error('Valor do pedido inválido');
-    }
+    ) {}
   }
 
killedBy: PedidoValidator deve rejeitar valor inválido: undefined
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Valor do pedido inválido"

Received function did not throw

[Killed] StringLiteral
src/validation/PedidoValidator.js:27:23
       !Number.isFinite(valor) ||
       valor <= 0
     ) {
-      throw new Error('Valor do pedido inválido');
+      throw new Error("");
     }
   }
killedBy: PedidoValidator deve rejeitar valor inválido: undefined
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Valor do pedido inválido"
Received message:   ""

      84 |         } else {
      85 |           stryCov_9fa48("238");
    > 86 |           throw new Error(stryMutAct_9fa48("239") ? "" : (stryCov_9fa48("239"), 'Valor do pedido inválido'));

[Killed] BlockStatement
src/validation/PedidoValidator.js:31:25
     }
   }
 
-  validarCartao(cartao) {
-    const cartaoNaoEhObjeto =
-      cartao === null ||
-      typeof cartao !== 'object' ||
-      Array.isArray(cartao);
-
-    if (cartaoNaoEhObjeto) {
-      throw new Error('Cartão inválido');
-    }
-
-    if (!this.campoPreenchido(cartao.numero)) {
-      throw new Error('Número do cartão é obrigatório');
-    }
-
-    if (!this.campoPreenchido(cartao.validade)) {
-      throw new Error('Validade do cartão é obrigatória');
-    }
-
-    if (!this.campoPreenchido(cartao.cvv)) {
-      throw new Error('CVV do cartão é obrigatório');
-    }
-  }
+  validarCartao(cartao) {}
 
   campoPreenchido(valor) {
killedBy: PedidoValidator deve rejeitar cartão inválido: undefined
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cartão inválido"

Received function did not throw

[Killed] ConditionalExpression
src/validation/PedidoValidator.js:33:7
 
   validarCartao(cartao) {
     const cartaoNaoEhObjeto =
-      cartao === null ||
-      typeof cartao !== 'object' ||
-      Array.isArray(cartao);
+      true;
 
     if (cartaoNaoEhObjeto) {
killedBy: POST /checkout deve retornar 200 quando o pagamento for aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] LogicalOperator
src/validation/PedidoValidator.js:33:7
 
   validarCartao(cartao) {
     const cartaoNaoEhObjeto =
-      cartao === null ||
-      typeof cartao !== 'object' ||
+      cartao === null && typeof cartao !== 'object' ||
       Array.isArray(cartao);
 
killedBy: PedidoValidator deve rejeitar cartão inválido: undefined
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cartão inválido"
Received message:   "Cannot read properties of undefined (reading 'numero')"

      103 |         }
      104 |       }
    > 105 |       if (stryMutAct_9fa48("257") ? false : stryMutAct_9fa48("256") ? true : stryMutAct_9fa48("255") ? this.campoPreenchido(cartao.numero) : (stryCov_9fa48("255", "256", "257"), !this.cam

[Killed] ConditionalExpression
src/validation/PedidoValidator.js:34:7
   validarCartao(cartao) {
     const cartaoNaoEhObjeto =
       cartao === null ||
-      typeof cartao !== 'object' ||
+      false ||
       Array.isArray(cartao);
 
killedBy: PedidoValidator deve rejeitar cartão inválido: undefined
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cartão inválido"
Received message:   "Cannot read properties of undefined (reading 'numero')"

      103 |         }
      104 |       }
    > 105 |       if (stryMutAct_9fa48("257") ? false : stryMutAct_9fa48("256") ? true : stryMutAct_9fa48("255") ? this.campoPreenchido(cartao.numero) : (stryCov_9fa48("255", "256", "257"), !this.cam

[Killed] EqualityOperator
src/validation/PedidoValidator.js:34:7
   validarCartao(cartao) {
     const cartaoNaoEhObjeto =
       cartao === null ||
-      typeof cartao !== 'object' ||
+      typeof cartao === 'object' ||
       Array.isArray(cartao);
 
killedBy: POST /checkout deve retornar 200 quando o pagamento for aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
src/validation/PedidoValidator.js:37:9
       typeof cartao !== 'object' ||
       Array.isArray(cartao);
 
-    if (cartaoNaoEhObjeto) {
+    if (true) {
       throw new Error('Cartão inválido');
     }
killedBy: POST /checkout deve retornar 200 quando o pagamento for aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
src/validation/PedidoValidator.js:37:9
       typeof cartao !== 'object' ||
       Array.isArray(cartao);
 
-    if (cartaoNaoEhObjeto) {
+    if (false) {
       throw new Error('Cartão inválido');
     }
killedBy: PedidoValidator deve rejeitar cartão inválido: undefined
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cartão inválido"
Received message:   "Cannot read properties of undefined (reading 'numero')"

      103 |         }
      104 |       }
    > 105 |       if (stryMutAct_9fa48("257") ? false : stryMutAct_9fa48("256") ? true : stryMutAct_9fa48("255") ? this.campoPreenchido(cartao.numero) : (stryCov_9fa48("255", "256", "257"), !this.cam

[Killed] ConditionalExpression
src/validation/PedidoValidator.js:41:9
       throw new Error('Cartão inválido');
     }
 
-    if (!this.campoPreenchido(cartao.numero)) {
+    if (true) {
       throw new Error('Número do cartão é obrigatório');
     }
killedBy: PedidoValidator deve aceitar um pedido válido
statusReason: Error: Número do cartão é obrigatório

[Killed] BlockStatement
src/validation/PedidoValidator.js:41:47
       throw new Error('Cartão inválido');
     }
 
-    if (!this.campoPreenchido(cartao.numero)) {
-      throw new Error('Número do cartão é obrigatório');
-    }
+    if (!this.campoPreenchido(cartao.numero)) {}
 
     if (!this.campoPreenchido(cartao.validade)) {
killedBy: PedidoValidator deve rejeitar cartão incompleto
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Número do cartão é obrigatório"

Received function did not throw

[Killed] ConditionalExpression
src/validation/PedidoValidator.js:45:9
       throw new Error('Número do cartão é obrigatório');
     }
 
-    if (!this.campoPreenchido(cartao.validade)) {
+    if (true) {
       throw new Error('Validade do cartão é obrigatória');
     }
killedBy: POST /checkout deve retornar 200 quando o pagamento for aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BooleanLiteral
src/validation/PedidoValidator.js:45:9
       throw new Error('Número do cartão é obrigatório');
     }
 
-    if (!this.campoPreenchido(cartao.validade)) {
+    if (this.campoPreenchido(cartao.validade)) {
       throw new Error('Validade do cartão é obrigatória');
     }
killedBy: PedidoValidator deve aceitar um pedido válido
statusReason: Error: Validade do cartão é obrigatória

[Killed] StringLiteral
src/validation/PedidoValidator.js:46:23
     }
 
     if (!this.campoPreenchido(cartao.validade)) {
-      throw new Error('Validade do cartão é obrigatória');
+      throw new Error("");
     }
 
killedBy: PedidoValidator deve rejeitar cartão incompleto
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Validade do cartão é obrigatória"
Received message:   ""

      116 |         } else {
      117 |           stryCov_9fa48("263");
    > 118 |           throw new Error(stryMutAct_9fa48("264") ? "" : (stryCov_9fa48("264"), 'Validade do cartão é obrigatória'));

[Killed] ConditionalExpression
src/validation/PedidoValidator.js:49:9
       throw new Error('Validade do cartão é obrigatória');
     }
 
-    if (!this.campoPreenchido(cartao.cvv)) {
+    if (false) {
       throw new Error('CVV do cartão é obrigatório');
     }
killedBy: PedidoValidator deve rejeitar cartão incompleto
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "CVV do cartão é obrigatório"

Received function did not throw

[Killed] ConditionalExpression
src/validation/PedidoValidator.js:49:9
       throw new Error('Validade do cartão é obrigatória');
     }
 
-    if (!this.campoPreenchido(cartao.cvv)) {
+    if (true) {
       throw new Error('CVV do cartão é obrigatório');
     }
killedBy: PedidoValidator deve aceitar um pedido válido
statusReason: Error: CVV do cartão é obrigatório

[Killed] BlockStatement
src/validation/PedidoValidator.js:54:26
     }
   }
 
-  campoPreenchido(valor) {
-    return (
-      typeof valor === 'string' &&
-      valor.trim().length > 0
-    );
-  }
+  campoPreenchido(valor) {}
 }
 
killedBy: POST /checkout deve retornar 200 quando o pagamento for aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
src/validation/PedidoValidator.js:56:7
 
   campoPreenchido(valor) {
     return (
-      typeof valor === 'string' &&
-      valor.trim().length > 0
+      true
     );
   }
killedBy: PedidoValidator deve rejeitar cartão incompleto
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Número do cartão é obrigatório"

Received function did not throw

[Killed] ConditionalExpression
src/validation/PedidoValidator.js:56:7
 
   campoPreenchido(valor) {
     return (
-      typeof valor === 'string' &&
+      true &&
       valor.trim().length > 0
     );
killedBy: PedidoValidator deve rejeitar cartão incompleto
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Número do cartão é obrigatório"
Received message:   "Cannot read properties of undefined (reading 'trim')"

      134 |     } else {
      135 |       stryCov_9fa48("270");

[Killed] EqualityOperator
src/validation/PedidoValidator.js:57:7
   campoPreenchido(valor) {
     return (
       typeof valor === 'string' &&
-      valor.trim().length > 0
+      valor.trim().length <= 0
     );
   }
killedBy: POST /checkout deve retornar 200 quando o pagamento for aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Survived] EqualityOperator
src/validation/PedidoValidator.js:57:7
   campoPreenchido(valor) {
     return (
       typeof valor === 'string' &&
-      valor.trim().length > 0
+      valor.trim().length >= 0
     );
   }

[Killed] ObjectLiteral
src/validation/PedidoValidator.js:62:18
   }
 }
 
-module.exports = {
-  PedidoValidator
-};
+module.exports = {};
 
killedBy: PedidoValidator deve aceitar um pedido válido
statusReason: TypeError: PedidoValidator is not a constructor
